label interlude:
    "어느 쪽의 이야기를 먼저 들으시겠습니까?"
    menu:
        "하늘":
            jump interlude_hanl
        "누리":
            jump interlude_nuri

label interlude_hanl:

    scene School_Library_Dark

    show hanl

    h "제 이름은 {color=#99D9EA}하늘{/color}. █████학교의 ■학년 ■반 반장을 맡고 있습니다."
    h "처음엔... 제가 이상해진 줄 알았습니다. \n뭔가 어딘가... 맞지 않는 느낌."
    h "지금 이 세상은,{p} 어딘가 잘못되어 있습니다."
    h "말도 안 되는 소리처럼 들릴지도 모르겠지만——{p}이 세계는, 반복되고 있습니다."
    h "철학에서 말하는 윤회도 아니고, SF에서 다루는 타임루프도 아닙니다."
    h "그냥{cps=6}...{/cps}{p}세계가 스스로를 고치려고 하는 것 같달까요."
    h "그렇게 생각하게 된 건...{p} 전학생 때문입니다."
    h "처음엔 단순한 기시감이었습니다.\n했던 말을 또 하고 있다는 느낌.\n전학생도... 뭔가 눈치 챈 것 같더군요."
    h "게다가——{p}도서관에서 발급하려던 학생증을 전학생은 이미 가지고 있었습니다."
    h "그 순간...\n전학생은 엄청난 고통을 호소하며 쓰러지고\n저 또한 극심한 두통에 자리에 주저앉아버렸습니다."
    h "그리고... 방과후에 도서관을 정리하던 중,\n책장에서 노트 한 권을 발견했습니다.\n누군가 놓고 간 건 줄 알았는데..."
    h "그 안엔 낯익은 글씨로,\n낯선 내용이 빼곡히 적혀 있었습니다."
    "전학생은 오늘 처음 온 게 아니다.{p}누리는 항상 그 아이게게 호의를 보인다.{p}전학생에게 큰 사고가 난 적이 있었다."
    h "제 글씨였습니다.\n처음엔 누군가의 장난인 줄 알았습니다."
    h "하지만— 너무 많은 것들이 들어맞았고,\n무엇보다 틀림없이 제 필체였습니다."
    h "이건... 반복을 인지한 또 다른 '저'의 기록이라고밖에 설명할 수 없었습니다."
    h "그래서 저는...\n다음에도 이 노트를 반드시 찾을 수 있게 잘 숨겨두었습니다."
    h "어쩌면{cps=6}...{/cps}\n이미 수 없이 놓쳤을지도 모르겠네요."